[M_Sage_Mission01 MissionDefinition]
MissionDescription="Sir Hammerlock has invited you to the swampy continent of Aegrus for a weekend of exploration, hunting, and friendship. You've just arrived -- time to find Hammerlock."

[M_Sage_Mission01:ClearLodgeSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock has invited you to the swampy continent of Aegrus for a weekend of exploration, hunting, and friendship.<br><br>Upon arriving at the lodge, it appears some of the local savages have moved in. You'll need to help them to move out before you can begin your hunting in earnest."

[M_Sage_Mission01:DefendSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Protect Hammerlock while he repairs the Catch-A-Boat machine."
MissionDescriptionOverride="Sir Hammerlock has invited you to the swampy continent of Aegrus for a weekend of exploration, hunting, and friendship.<br><br>You met up with Hammerlock on the edge of the swamp. Hammerlock thinks that the most enjoyable hunting will be found deep in the heart of Aegrus, however, and has suggested that you take a fan boat into the swamp's mucky center.<br><br>The nearby Catch-A-Boat machine is broken, sadly, and you'll need it in working order if you plan on heading any deeper into the swamp. You'll have to protect Hammerlock while he fixes it."
